
/* Використовуємо перші два let для заповнення даних, для розрахунку
далі в switch передаємо одиницю, яку ввів користувач, якщо вона підпадає хоч під один з наших кейсів
значить в консоль виводимо результат математичної операції (конвертації), якщо не підпадає, то виводимо дефолтне значення
Також для зручності користувача додала базові відмінювання, щоб інтуітивно легше було вводити текст без дод. думок*/


let одиниця_виміру = 'год';
let кількість = 4;
let відповідь;

switch(одиниця_виміру) {
    case 'кілометри':
    case 'кілометра':
    case 'кілометрів':      
    case 'кілометр':
        відповідь = кількість * 1000;
        console.log(`${кількість} км це ${відповідь} м.`);
        break;
    case 'година':
    case 'години':
    case 'годин':
        відповідь = кількість * 60;
        console.log(`${кількість} год це ${відповідь} хв.`);
        break;
    case 'кілограм':
    case 'кілограма':
    case 'кілограми':
    case 'кілограмів':
        відповідь = кількість * 1000;
        console.log(`${кількість} кг це ${відповідь} г.`);
        break;
    default:
            console.log('З такою одиницею виміру, я ще не навчився працювати(.');

}