/* 1) в результаті буде: 𝗻𝘂𝗺𝗯𝗲𝗿𝟯𝟯 з типпом 𝘀𝘁𝗿𝗶𝗻𝗴, тому що відбувається конкантинація, коли зустрічається рядок з плюсом*/
// 2) в результаті буде: 𝟯, тому що нул при додавані приведеться до нуля, а 0+3 = 3
/*3) в результаті буде: 𝗾𝘄𝗲𝗿𝘁𝘆, тому що оператор && буде переводити до значень true або false, і оскільки у прикладі були значення, 
які відповідали true, то у відповіді буде відображене останнє значення істини*/
/* 4) в результаті буде: 𝟰𝟬𝟮𝗵𝗶𝗹𝗹𝗲𝗹, тому що з унарними плюсиками, спочатку буде (при можливості, яка в прикладі є) перетворення з рядка на 
число, а потім йде звичайне додавання з плюсом не унарним і знову вступає в силу конкантинація, і все перетворюється в рядок і 
 просто склеюється*/
/* 5) в результаті буде: 𝗳𝗮𝗹𝘀𝗲, тому що знак === означає суворе дорівнює, по перше "10" це рядок, по друге 10-5 = 5, тож тут ніяк
 не вийде 6, ще й набмер */
//6) в результаті буде: 𝟭, тому що якщо true перевести в bool значення, то воно буде дорівнювати одиниці, а false нулю, а 1+0 = 1 
/* 7) в результаті буде: 𝗡𝗮𝗡, тому що, як казала Дар'я на лекції апельсини не можна відняти від кроликів,
'4px' є рядком, і через те що присутні ще букви, то JS не зможе його перетворити на намбер, яким є число 3 */
// 8) в результаті буде: 𝟭, тому що якщо лише цифри в стрінг, то JS їх конвертує в намбер і зробить віднімання, 4 - 3 = 1
/* 9) в результаті буде: 𝟲𝟭 з типом 𝘀𝘁𝗿, тому що знак ** означає звести в ступінь, 3 в ступені 0 буде дорівнювати 1, 
 ця операція почнеться першою, бо такий вираз є правоасоціативним, через те що зведення в ступінь має вищий пріорітет, 
 коли ми отримали праворуч значення 1, далі у нас вступає в дію конкантенація, де в рядок 6 приліплюється значення 1 */
/* 10) в результаті буде: 𝟮, тому що при ділені правила ті самі що і при (напр.) віднімані, JS перетворює рядок в намбер і виконує
 звичайне математичне рівняння 12 / 6 = 2 */
/* 11) в результаті буде: 𝟭𝟬𝗳𝗮𝗹𝘀𝗲 з типом 𝘀𝘁𝗿, тому що це правоаціативний вираз, спочатку виконається оператор суворе дорівнює
 (який позначається ===), і виведе значення false, бо 5 не дорівнює 6, а далі піде конкантинація, де до рядка з значенням 10 додасться
 текст false */
// 12) в результаті буде: 𝗳𝗮𝗹𝘀𝗲, тому що якщо переводити до булевого виразу, то буде false false, дорівнює у відповіді false 
/* 13) в результаті буде: 𝟮𝟳, тому що це правоасоціативна операція, спочатку ділення в дужках, в результаті буде 3,
 потім 3 взводиться в ступінь 3, що = 27 */
/* 14) в результаті буде: 𝘁𝗿𝘂𝗲, тому що це подвійне заперечення, відповідаючи на запитання "чи не дорівнює фолс значенню тру?" відповідь
 так, не дорівнює*/
/* 15) в результаті буде: 𝟭,(або 𝘁𝗿𝘂𝗲) тому що, спочатку виконали ліву частину операції, оскільки це лівоасоціативна операція (через логічний оператор або)
 результат  є false, далі друга частина виконується, (з логічним оператором AND), нуль як рядок дає тру, і 1 дає тру, значить відповідь 1(тру)*/
/* 16) в результаті буде: 𝗳𝗮𝗹𝘀𝗲, тому що спочатку виконається ліва частина умови з унарним додаванням і нал стане 0, і якщо привести false
до булевого значення, то це також буде 0, а отже 0 буде дорівнювати 0, і це правда, далі ми виконуємо праву частину, і оскільки 1 = 1,
 то результат буде false */
/* 17) в результаті буде: 𝘁𝗿𝘂𝗲, тому що при віконанні лівої частини виразу (оскільки це лівоасоціативне рівняння) ми отримали false
 (оскільки && - повертає true, якщо обидва операнди є true, а у нас перше значення false), ми переходимо до правої частини виразу, яка
 повертає True коли хоча б один з операндів повертає тру, а у нас їх аж два, тож без шансів отримати false */
/* 18) в результаті буде: 𝗳𝗮𝗹𝘀𝗲, тому що спочатку виконається права частина, бо дужки надають перевагу рівнянні, і це вже буде правоасоціативний
 вираз, і ми спочатку отримуємо true, а потім виконується ліва частина, а там вже оператор and фкий нам каже, що він хоче щоб було все 
 true інакше він повертає false, і виходить що false і true поверне false */
/* 19) в результаті буде: 𝗳𝗮𝗹𝘀𝗲, тому що при виконані лівої частини, у нас нал став нулем, фолс також і отримали true, і перейшли до правої
 1 підняли до степені 5 і отримали 1, і знову ця пастка, наче отримали 1 з лівої частини і 1 з правої, але знак не дорівнює, а <, тож 
 відповідь не True, a false */